benchmark/results/loadtest.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.0s/2m0s

running (0m02.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m02.0s/2m0s

running (0m03.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m03.0s/2m0s

running (0m04.0s), 10/10 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m04.0s/2m0s

running (0m05.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m05.0s/2m0s

running (0m06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m06.0s/2m0s

running (0m07.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m07.0s/2m0s

running (0m08.0s), 10/10 VUs, 14 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m08.0s/2m0s

running (0m09.0s), 10/10 VUs, 15 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m09.0s/2m0s

running (0m10.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m10.0s/2m0s

running (0m11.0s), 10/10 VUs, 19 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m11.0s/2m0s

running (0m12.0s), 10/10 VUs, 21 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m12.0s/2m0s

running (0m13.0s), 10/10 VUs, 23 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m13.0s/2m0s

running (0m14.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m14.0s/2m0s

running (0m15.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m15.0s/2m0s

running (0m16.0s), 10/10 VUs, 29 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m16.0s/2m0s

running (0m17.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m17.0s/2m0s

running (0m18.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m18.0s/2m0s

running (0m19.0s), 10/10 VUs, 34 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m19.0s/2m0s

running (0m20.0s), 10/10 VUs, 35 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m20.0s/2m0s

running (0m21.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m21.0s/2m0s

running (0m22.0s), 10/10 VUs, 39 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m22.0s/2m0s

running (0m23.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m23.0s/2m0s

running (0m24.0s), 10/10 VUs, 43 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m24.0s/2m0s

running (0m25.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m25.0s/2m0s

running (0m26.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m26.0s/2m0s

running (0m27.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m27.0s/2m0s

running (0m28.0s), 10/10 VUs, 51 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m28.0s/2m0s

running (0m29.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m29.0s/2m0s

running (0m30.0s), 10/10 VUs, 55 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m30.0s/2m0s

running (0m31.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m31.0s/2m0s

running (0m32.0s), 10/10 VUs, 59 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m32.0s/2m0s

running (0m33.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m33.0s/2m0s

running (0m34.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m34.0s/2m0s

running (0m35.0s), 10/10 VUs, 64 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m35.0s/2m0s

running (0m36.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m36.0s/2m0s

running (0m37.0s), 10/10 VUs, 69 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m37.0s/2m0s

running (0m38.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m38.0s/2m0s

running (0m39.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m39.0s/2m0s

running (0m40.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m40.0s/2m0s

running (0m41.0s), 10/10 VUs, 75 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m41.0s/2m0s

running (0m42.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m42.0s/2m0s

running (0m43.0s), 10/10 VUs, 78 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m43.0s/2m0s

running (0m44.0s), 10/10 VUs, 81 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m44.0s/2m0s

running (0m45.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m45.0s/2m0s

running (0m46.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m46.0s/2m0s

running (0m47.0s), 10/10 VUs, 86 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m47.0s/2m0s

running (0m48.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m48.0s/2m0s

running (0m49.0s), 10/10 VUs, 89 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m49.0s/2m0s

running (0m50.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m50.0s/2m0s

running (0m51.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m51.0s/2m0s

running (0m52.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m52.0s/2m0s

running (0m53.0s), 10/10 VUs, 97 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m53.0s/2m0s

running (0m54.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m54.0s/2m0s

running (0m55.0s), 10/10 VUs, 102 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m55.0s/2m0s

running (0m56.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m56.0s/2m0s

running (0m57.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m57.0s/2m0s

running (0m58.0s), 10/10 VUs, 106 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m58.0s/2m0s

running (0m59.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m59.0s/2m0s

running (1m00.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m00.0s/2m0s

running (1m01.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m01.0s/2m0s

running (1m02.0s), 10/10 VUs, 113 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m02.0s/2m0s

running (1m03.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m03.0s/2m0s

running (1m04.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m04.0s/2m0s

running (1m05.0s), 10/10 VUs, 119 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m05.0s/2m0s

running (1m06.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m06.0s/2m0s

running (1m07.0s), 10/10 VUs, 122 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m07.0s/2m0s

running (1m08.0s), 10/10 VUs, 125 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m08.0s/2m0s

running (1m09.0s), 10/10 VUs, 126 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m09.0s/2m0s

running (1m10.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m10.0s/2m0s

running (1m11.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m11.0s/2m0s

running (1m12.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m12.0s/2m0s

running (1m13.0s), 10/10 VUs, 134 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m13.0s/2m0s

running (1m14.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m14.0s/2m0s

running (1m15.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m15.0s/2m0s

running (1m16.0s), 10/10 VUs, 137 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m16.0s/2m0s

running (1m17.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m17.0s/2m0s

running (1m18.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m18.0s/2m0s

running (1m19.0s), 10/10 VUs, 143 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m19.0s/2m0s

running (1m20.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m20.0s/2m0s

running (1m21.0s), 10/10 VUs, 146 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  1m21.0s/2m0s

running (1m22.0s), 10/10 VUs, 147 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  1m22.0s/2m0s

running (1m23.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  1m23.0s/2m0s

running (1m24.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  1m24.0s/2m0s

running (1m25.0s), 10/10 VUs, 152 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  1m25.0s/2m0s

running (1m26.0s), 10/10 VUs, 154 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m26.0s/2m0s

running (1m27.0s), 10/10 VUs, 155 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  1m27.0s/2m0s

running (1m28.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  1m28.0s/2m0s

running (1m29.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  1m29.0s/2m0s

running (1m30.0s), 10/10 VUs, 161 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  1m30.0s/2m0s

running (1m31.0s), 10/10 VUs, 164 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  1m31.0s/2m0s

running (1m32.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m32.0s/2m0s

running (1m33.0s), 10/10 VUs, 166 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  1m33.0s/2m0s

running (1m34.0s), 10/10 VUs, 168 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  1m34.0s/2m0s

running (1m35.0s), 10/10 VUs, 169 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  1m35.0s/2m0s

running (1m36.0s), 10/10 VUs, 171 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  1m36.0s/2m0s

running (1m37.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  1m37.0s/2m0s

running (1m38.0s), 10/10 VUs, 174 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m38.0s/2m0s

running (1m39.0s), 10/10 VUs, 176 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  1m39.0s/2m0s

running (1m40.0s), 10/10 VUs, 178 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  1m40.0s/2m0s

running (1m41.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  1m41.0s/2m0s

running (1m42.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  1m42.0s/2m0s

running (1m43.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  1m43.0s/2m0s

running (1m44.0s), 10/10 VUs, 184 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m44.0s/2m0s

running (1m45.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  1m45.0s/2m0s

running (1m46.0s), 10/10 VUs, 187 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  1m46.0s/2m0s

running (1m47.0s), 10/10 VUs, 189 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  1m47.0s/2m0s

running (1m48.0s), 10/10 VUs, 191 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  1m48.0s/2m0s

running (1m49.0s), 10/10 VUs, 192 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  1m49.0s/2m0s

running (1m50.0s), 10/10 VUs, 194 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m50.0s/2m0s

running (1m51.0s), 10/10 VUs, 195 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  1m51.0s/2m0s

running (1m52.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  1m52.0s/2m0s

running (1m53.0s), 10/10 VUs, 199 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  1m53.0s/2m0s

running (1m54.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  1m54.0s/2m0s

running (1m55.0s), 10/10 VUs, 202 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  1m55.0s/2m0s

running (1m56.0s), 10/10 VUs, 203 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m56.0s/2m0s

running (1m57.0s), 10/10 VUs, 205 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  1m57.0s/2m0s

running (1m58.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  1m58.0s/2m0s

running (1m59.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  1m59.0s/2m0s

running (2m00.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  2m00.0s/2m0s

running (2m01.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s

running (2m02.0s), 07/10 VUs, 213 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s

running (2m03.0s), 05/10 VUs, 215 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s

running (2m04.0s), 05/10 VUs, 215 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s

running (2m05.0s), 04/10 VUs, 216 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s

running (2m06.0s), 01/10 VUs, 219 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  2m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95) < 4000' p(95)=7.19s

    http_req_failed
    ✓ 'rate < 0.05' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=5.31s min=951.57ms med=5.36s max=8.23s p(90)=6.99s p(95)=7.19s
      { expected_response:true }...: avg=5.31s min=951.57ms med=5.36s max=8.23s p(90)=6.99s p(95)=7.19s
    http_req_failed................: 0.00%  0 out of 220
    http_reqs......................: 220    1.740123/s

    EXECUTION
    iteration_duration.............: avg=5.62s min=1.31s    med=5.66s max=8.53s p(90)=7.29s p(95)=7.49s
    iterations.....................: 220    1.740123/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 202 kB 1.6 kB/s
    data_sent......................: 67 kB  533 B/s



running (2m06.4s), 00/10 VUs, 220 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s